org/lrn/lisp/lisp-3.org
* План работ

Цель этого этапа - создание лексического окружения (в дополнение к динамическому
окружению и глобальному окружению, которые у нас уже есть). Так мы решаем
~funarg-problem~, проблему функционального аргумента. Проблема возникает в программах
на языках, которые поддерживают функции как объекты первого класса (first-class
sitizens): позволяюn передавать функции в качестве параметров и возвращать функции из
функций.

~funarg problem~ возникает, когда тело определяемой функции ссылается на
идентификаторы, которые определены в окружении, где функция определяется. В то время
как мы бы хотели, чтобы ссылки вели на окружение, в котором функция вызывается.

Есть 2 типа этой проблемы:
- downward - когда в функцию передается функция [TODO:gmm] Подробнее, с примером
- upward - когда вызывающая функция ссылается на окружение вызываемой после завершения
  вызова

В качестве примера ~upward~ возьмем такой код:

#+BEGIN_SRC lisp
  ;; UPWARD FUNARG PROBLEM

  ;; Создадим функцию F, которая возвращает функцию в замыкании по X
  (setq f (lambda (x)
             (lambda (y)
               (+ x y))))

  ;; С помощью F создадим функцию G
  (setq g (funcall f 5))

  ;; В этой функции X ссылается на 10, но после возврата из FUNCALL окружение, где X=10
  ;; уже не существует

  ;; тут при вызове Y=10, а X ссылается на несуществующее окружение
  (funcall g 10)

  ;; Чтобы получить верный ответ (15) нужно сохранять окружение в момент создания замыкания
  ;; тогда даже такой код будет давать 15
  (let ((x 30))
    (funcall g 10))
#+END_SRC

Еще один интересный пример ~upward~ funarg problem:

#+BEGIN_SRC lisp
  (defun compose (f g)
    (lambda (x) (funcall f (funcall g x))))

  (funcall (compose #'car #'cdr) '(1 2 3 4))

  ;; Более развернутый вариант этого:

  ;; Создадим функцию COMPOSE, возвращую лямбду, которая
  ;; примененяет первый функциональный аргумент ко второму.
  (setq compose (lambda (f g)
                  (lambda (x)
                    (funcall f (funcall g x)))))

  ;; Создадим функцию F, которая является функцией,
  ;; применяющий CAR к CDR
  (setq f (funcall compose #'car #'cdr))

  ;; Вызовем полученную функцию F от списка (хотим получить 2)
  (funcall f '(1 2 3 4))
#+END_SRC

Когда мы возвращаем лямбду из ~compose~ мы теряем окружение (динамическое окружение,
содержащее ~f~ и ~g~ осталось в месте где лямбда определялась) и у нас нет никакого
способа применить ~f~ к ~(funcall g x)~, так как у нас уже нет ~g~ в окружении.

Таким образом это ~upward~ funarg problem [TODO:gmm] Правильно рассуждаю?
[TODO:gmm] Нужен корректный пример ~downward~ funarg problem

Нам нужно уметь замыкать окружение лексически, тогда лямбда возвратит замыкание, где у
нас будут связанные ~f~ и ~g~.

Трассировка выполнения еще более наглядно поясняет ~upward~

#+BEGIN_SRC lisp
  ;; Трассируем такой код:
  (((lambda (x)
      (lambda (y) x))
    1)
   2)

  0: (MYEVAL (((LAMBDA (X) (LAMBDA (Y) X)) 1) 2) NIL)
    1: (MYEVAL ((LAMBDA (X) (LAMBDA (Y) X)) 1) NIL)
      2: (MYEVAL (LAMBDA (X) (LAMBDA (Y) X)) NIL)       ;; вычисляем car формы
      2: MYEVAL returned (LAMBDA (X) (LAMBDA (Y) X))    ;; lambda вычисляется в себя
      2: (MYEVAL 1 NIL)                                 ;; вычисляем первый аргумет 1
      2: MYEVAL returned 1                              ;; числа самовычислимы
      2: (MYAPPLY (LAMBDA (X) (LAMBDA (Y) X)) (1) NIL)  ;; применяем первую лямбду
        3: (MYEVAL (LAMBDA (Y) X) ((X . 1)))            ;; тело первой лямбды -- вторая лямбда  -> тут будет замыкание
        3: MYEVAL returned (LAMBDA (Y) X)               ;; лямбда вычисляется в себя
      2: MYAPPLY returned (LAMBDA (Y) X)
    1: MYEVAL returned (LAMBDA (Y) X)
    1: (MYEVAL 2 NIL)                                   ;; вычисляем второй аргумент
    1: MYEVAL returned 2                                ;; он самовычислим
    1: (MYAPPLY (LAMBDA (Y) X) (2) NIL)                 ;; применяем лямбду (вторую), но обрати внимание на окружение
      2: (MYEVAL X ((Y . 2)))                           ;; окуржение ((x . 1)) пропало

  ;; CL-вариант
  (defun mymapcar (fn lst)
    (cond ((null lst) nil)
          (t (cons (funcall fn (car lst))
                   (mymapcar fn (cdr lst))))))


  ;; MICROLISP-вариант
  (defun mymapcar (fn lst)
    (cond ((null lst) nil)
          (t (cons (fn (car lst))
                   (mymapcar fn (cdr lst))))))


  (defun foo (lst)
      (mymapcar (lambda (i) (cons i lst)) '(1 2 3)))

  (foo '(a b c))

  CL-USER>
  ((1 a b c)
   (2 a b c)
   (3 a b c))

  microlisp>
  ((1 1 2 3) (2 2 3) (3 3))
#+END_SRC

Теперь рассмотрим ~downward~

#+BEGIN_SRC lisp
  ;; DOWNWARD FUNARG PROBLEM

  ;; Создадим свой mapcar
  (defun mymapcar (fn lst)
    (cond ((null lst) nil)
          (t (cons (funcall fn (car lst))
                   (mymapcar fn (cdr lst))))))

  ;; Создадим функцию FOO, которая принимает список LST и использует
  ;; MYMAPCAR чтобы сконсить его с каждым из элементов списка (1 2 3)
  (defun foo (lst)
    (mymapcar (lambda (i)
                (cons i lst))
              '(1 2 3)))

  ;; Когда мы вызовем ... TODO
  (foo '(a b c))

  => ((1 A B C)
      (2 A B C)
      (3 A B C))
#+END_SRC

