www/lrn/lisp/lisp-3.html
<!DOCTYPE html>
<html>
<head>
<title></title>
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="rigidus">
<link href="/css/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title"></h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#unnumbered-1">План работ</a></li>
<li><a href="#unnumbered-2">Окружения и MyApply</a>
<ul>
<li><a href="#unnumbered-3">Работа с CONS-ячейками</a></li>
<li><a href="#unnumbered-4">NULL-предикат</a></li>
<li><a href="#unnumbered-5">Встроенные функции арифметики</a></li>
<li><a href="#unnumbered-6"><span class="done nilCANCEL">CANCEL</span> Вычисление символов-функций</a></li>
<li><a href="#unnumbered-7"><span class="done nilCANCEL">CANCEL</span> LAMBDA</a></li>
</ul>
</li>
<li><a href="#unnumbered-8">MyEval</a>
<ul>
<li><a href="#unnumbered-9">Самовычисляемые формы</a></li>
<li><a href="#unnumbered-10">Вычисление символов</a></li>
<li><a href="#unnumbered-11">Цитирование</a></li>
<li><a href="#unnumbered-12">Условное выполнение IF</a></li>
<li><a href="#unnumbered-13">COND</a></li>
<li><a href="#unnumbered-14">PROGN</a></li>
<li><a href="#unnumbered-15">PRINT</a></li>
<li><a href="#unnumbered-16">LIST</a></li>
<li><a href="#unnumbered-17">AND</a></li>
<li><a href="#unnumbered-18">OR</a></li>
<li><a href="#unnumbered-19">LET</a></li>
<li><a href="#unnumbered-20">LET*</a></li>
<li><a href="#unnumbered-21">DEFUN</a></li>
<li><a href="#unnumbered-22">SETQ</a></li>
<li><a href="#unnumbered-23">LAMBDA</a></li>
</ul>
</li>
<li><a href="#unnumbered-24">Repl</a></li>
<li><a href="#unnumbered-25">Итоги</a></li>
</ul>
</div>
</div>

<div id="outline-container-unnumbered-1" class="outline-2">
<h2 id="unnumbered-1">План работ</h2>
<div class="outline-text-2" id="text-unnumbered-1">
<p>
Цель этого этапа - создание лексического окружения (в дополнение к динамическому
окружению и глобальному окружению, которые у нас уже есть). Так мы решаем
<code>funarg-problem</code>, проблему функционального аргумента. Проблема возникает в программах
на языках, которые поддерживают функции как объекты первого класса (first-class
sitizens): позволяюn передавать функции в качестве параметров и возвращать функции из
функций.
</p>

<p>
<code>funarg problem</code> возникает, когда тело определяемой функции ссылается на
идентификаторы, которые определены в окружении, где функция определяется. В то время
как мы бы хотели, чтобы ссылки вели на окружение, в котором функция вызывается.
</p>

<p>
Есть 2 типа этой проблемы:
</p>
<ul class="org-ul">
<li>downward - когда в функцию передается функция [TODO:gmm] Подробнее, с примером
</li>
<li>upward - когда вызывающая функция ссылается на окружение вызываемой после завершения
вызова
</li>
</ul>

<p>
В качестве примера <code>upward</code> возьмем такой код:
</p>

<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #af0000;">;; </span><span style="color: #af0000;">UPWARD FUNARG PROBLEM</span>

<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1057;&#1086;&#1079;&#1076;&#1072;&#1076;&#1080;&#1084; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1102; F, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1102; &#1074; &#1079;&#1072;&#1084;&#1099;&#1082;&#1072;&#1085;&#1080;&#1080; &#1087;&#1086; X</span>
(setq f (<span style="color: #af00ff;">lambda</span> (x)
           (<span style="color: #af00ff;">lambda</span> (y)
             (+ x y))))

<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1057; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; F &#1089;&#1086;&#1079;&#1076;&#1072;&#1076;&#1080;&#1084; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1102; G</span>
(setq g (funcall f 5))

<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1042; &#1101;&#1090;&#1086;&#1081; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; X &#1089;&#1089;&#1099;&#1083;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072; 10, &#1085;&#1086; &#1087;&#1086;&#1089;&#1083;&#1077; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1090;&#1072; &#1080;&#1079; FUNCALL &#1086;&#1082;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1077;, &#1075;&#1076;&#1077; X=10</span>
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1091;&#1078;&#1077; &#1085;&#1077; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090;</span>

<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1090;&#1091;&#1090; &#1087;&#1088;&#1080; &#1074;&#1099;&#1079;&#1086;&#1074;&#1077; Y=10, &#1072; X &#1089;&#1089;&#1099;&#1083;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072; &#1085;&#1077;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1077; &#1086;&#1082;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1077;</span>
(funcall g 10)

<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1063;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1074;&#1077;&#1088;&#1085;&#1099;&#1081; &#1086;&#1090;&#1074;&#1077;&#1090; (15) &#1085;&#1091;&#1078;&#1085;&#1086; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1090;&#1100; &#1086;&#1082;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1077; &#1074; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1079;&#1072;&#1084;&#1099;&#1082;&#1072;&#1085;&#1080;&#1103;</span>
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1090;&#1086;&#1075;&#1076;&#1072; &#1076;&#1072;&#1078;&#1077; &#1090;&#1072;&#1082;&#1086;&#1081; &#1082;&#1086;&#1076; &#1073;&#1091;&#1076;&#1077;&#1090; &#1076;&#1072;&#1074;&#1072;&#1090;&#1100; 15</span>
(<span style="color: #af00ff;">let</span> ((x 30))
  (funcall g 10))
</pre>
</div>

<p>
Еще один интересный пример <code>upward</code> funarg problem:
</p>

<div class="org-src-container">

<pre class="src src-lisp">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">compose</span> (f g)
  (<span style="color: #af00ff;">lambda</span> (x) (funcall f (funcall g x))))

(funcall (compose #'car #'cdr) '(1 2 3 4))

<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1041;&#1086;&#1083;&#1077;&#1077; &#1088;&#1072;&#1079;&#1074;&#1077;&#1088;&#1085;&#1091;&#1090;&#1099;&#1081; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090; &#1101;&#1090;&#1086;&#1075;&#1086;:</span>

<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1057;&#1086;&#1079;&#1076;&#1072;&#1076;&#1080;&#1084; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1102; COMPOSE, &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1091;&#1102; &#1083;&#1103;&#1084;&#1073;&#1076;&#1091;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103;</span>
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1103;&#1077;&#1090; &#1087;&#1077;&#1088;&#1074;&#1099;&#1081; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090; &#1082;&#1086; &#1074;&#1090;&#1086;&#1088;&#1086;&#1084;&#1091;.</span>
(setq compose (<span style="color: #af00ff;">lambda</span> (f g)
                (<span style="color: #af00ff;">lambda</span> (x)
                  (funcall f (funcall g x)))))

<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1057;&#1086;&#1079;&#1076;&#1072;&#1076;&#1080;&#1084; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1102; F, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1077;&#1081;,</span>
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1103;&#1102;&#1097;&#1080;&#1081; CAR &#1082; CDR</span>
(setq f (funcall compose #'car #'cdr))

<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1042;&#1099;&#1079;&#1086;&#1074;&#1077;&#1084; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1085;&#1091;&#1102; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1102; F &#1086;&#1090; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; (&#1093;&#1086;&#1090;&#1080;&#1084; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; 2)</span>
(funcall f '(1 2 3 4))
</pre>
</div>

<p>
Когда мы возвращаем лямбду из <code>compose</code> мы теряем окружение (динамическое окружение,
содержащее <code>f</code> и <code>g</code> осталось в месте где лямбда определялась) и у нас нет никакого
способа применить <code>f</code> к <code>(funcall g x)</code>, так как у нас уже нет <code>g</code> в окружении.
</p>

<p>
Таким образом это <code>upward</code> funarg problem [TODO:gmm] Правильно рассуждаю?
[TODO:gmm] Нужен корректный пример <code>downward</code> funarg problem
</p>

<p>
Нам нужно уметь замыкать окружение лексически, тогда лямбда возвратит замыкание, где у
нас будут связанные <code>f</code> и <code>g</code>.
</p>

<p>
Трассировка выполнения еще более наглядно поясняет <code>upward</code>
</p>

<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1088;&#1072;&#1089;&#1089;&#1080;&#1088;&#1091;&#1077;&#1084; &#1090;&#1072;&#1082;&#1086;&#1081; &#1082;&#1086;&#1076;:</span>
(((<span style="color: #af00ff;">lambda</span> (x)
    (<span style="color: #af00ff;">lambda</span> (y) x))
  1)
 2)

0: (MYEVAL (((<span style="color: #af00ff;">LAMBDA</span> (X) (<span style="color: #af00ff;">LAMBDA</span> (Y) X)) 1) 2) NIL)
  1: (MYEVAL ((<span style="color: #af00ff;">LAMBDA</span> (X) (<span style="color: #af00ff;">LAMBDA</span> (Y) X)) 1) NIL)
    2: (MYEVAL (<span style="color: #af00ff;">LAMBDA</span> (X) (<span style="color: #af00ff;">LAMBDA</span> (Y) X)) NIL)       <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1103;&#1077;&#1084; car &#1092;&#1086;&#1088;&#1084;&#1099;</span>
    2: MYEVAL returned (<span style="color: #af00ff;">LAMBDA</span> (X) (<span style="color: #af00ff;">LAMBDA</span> (Y) X))    <span style="color: #af0000;">;; </span><span style="color: #af0000;">lambda &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074; &#1089;&#1077;&#1073;&#1103;</span>
    2: (MYEVAL 1 NIL)                                 <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1103;&#1077;&#1084; &#1087;&#1077;&#1088;&#1074;&#1099;&#1081; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1090; 1</span>
    2: MYEVAL returned 1                              <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1095;&#1080;&#1089;&#1083;&#1072; &#1089;&#1072;&#1084;&#1086;&#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1080;&#1084;&#1099;</span>
    2: (MYAPPLY (<span style="color: #af00ff;">LAMBDA</span> (X) (<span style="color: #af00ff;">LAMBDA</span> (Y) X)) (1) NIL)  <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1103;&#1077;&#1084; &#1087;&#1077;&#1088;&#1074;&#1091;&#1102; &#1083;&#1103;&#1084;&#1073;&#1076;&#1091;</span>
      3: (MYEVAL (<span style="color: #af00ff;">LAMBDA</span> (Y) X) ((X . 1)))            <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1090;&#1077;&#1083;&#1086; &#1087;&#1077;&#1088;&#1074;&#1086;&#1081; &#1083;&#1103;&#1084;&#1073;&#1076;&#1099; -- &#1074;&#1090;&#1086;&#1088;&#1072;&#1103; &#1083;&#1103;&#1084;&#1073;&#1076;&#1072;  -&gt; &#1090;&#1091;&#1090; &#1073;&#1091;&#1076;&#1077;&#1090; &#1079;&#1072;&#1084;&#1099;&#1082;&#1072;&#1085;&#1080;&#1077;</span>
      3: MYEVAL returned (<span style="color: #af00ff;">LAMBDA</span> (Y) X)               <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1083;&#1103;&#1084;&#1073;&#1076;&#1072; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074; &#1089;&#1077;&#1073;&#1103;</span>
    2: MYAPPLY returned (<span style="color: #af00ff;">LAMBDA</span> (Y) X)
  1: MYEVAL returned (<span style="color: #af00ff;">LAMBDA</span> (Y) X)
  1: (MYEVAL 2 NIL)                                   <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1103;&#1077;&#1084; &#1074;&#1090;&#1086;&#1088;&#1086;&#1081; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;</span>
  1: MYEVAL returned 2                                <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1086;&#1085; &#1089;&#1072;&#1084;&#1086;&#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1080;&#1084;</span>
  1: (MYAPPLY (<span style="color: #af00ff;">LAMBDA</span> (Y) X) (2) NIL)                 <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1103;&#1077;&#1084; &#1083;&#1103;&#1084;&#1073;&#1076;&#1091; (&#1074;&#1090;&#1086;&#1088;&#1091;&#1102;), &#1085;&#1086; &#1086;&#1073;&#1088;&#1072;&#1090;&#1080; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077; &#1085;&#1072; &#1086;&#1082;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1077;</span>
    2: (MYEVAL X ((Y . 2)))                           <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1086;&#1082;&#1091;&#1088;&#1078;&#1077;&#1085;&#1080;&#1077; ((x . 1)) &#1087;&#1088;&#1086;&#1087;&#1072;&#1083;&#1086;</span>

<span style="color: #af0000;">;; </span><span style="color: #af0000;">CL-&#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;</span>
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">mymapcar</span> (fn lst)
  (<span style="color: #af00ff;">cond</span> ((null lst) nil)
        (t (cons (funcall fn (car lst))
                 (mymapcar fn (cdr lst))))))


<span style="color: #af0000;">;; </span><span style="color: #af0000;">MICROLISP-&#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;</span>
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">mymapcar</span> (fn lst)
  (<span style="color: #af00ff;">cond</span> ((null lst) nil)
        (t (cons (fn (car lst))
                 (mymapcar fn (cdr lst))))))


(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">foo</span> (lst)
    (mymapcar (<span style="color: #af00ff;">lambda</span> (i) (cons i lst)) '(1 2 3)))

(foo '(a b c))

CL-USER&gt;
((1 a b c)
 (2 a b c)
 (3 a b c))

microlisp&gt;
((1 1 2 3) (2 2 3) (3 3))
</pre>
</div>

<p>
Теперь рассмотрим <code>downward</code>
</p>

<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #af0000;">;; </span><span style="color: #af0000;">DOWNWARD FUNARG PROBLEM</span>

<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1057;&#1086;&#1079;&#1076;&#1072;&#1076;&#1080;&#1084; &#1089;&#1074;&#1086;&#1081; mapcar</span>
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">mymapcar</span> (fn lst)
  (<span style="color: #af00ff;">cond</span> ((null lst) nil)
        (t (cons (funcall fn (car lst))
                 (mymapcar fn (cdr lst))))))

<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1057;&#1086;&#1079;&#1076;&#1072;&#1076;&#1080;&#1084; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1102; FOO, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; LST &#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;</span>
<span style="color: #af0000;">;; </span><span style="color: #af0000;">MYMAPCAR &#1095;&#1090;&#1086;&#1073;&#1099; &#1089;&#1082;&#1086;&#1085;&#1089;&#1080;&#1090;&#1100; &#1077;&#1075;&#1086; &#1089; &#1082;&#1072;&#1078;&#1076;&#1099;&#1084; &#1080;&#1079; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; (1 2 3)</span>
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">foo</span> (lst)
  (mymapcar (<span style="color: #af00ff;">lambda</span> (i)
              (cons i lst))
            '(1 2 3)))

<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1050;&#1086;&#1075;&#1076;&#1072; &#1084;&#1099; &#1074;&#1099;&#1079;&#1086;&#1074;&#1077;&#1084; ... TODO</span>
(foo '(a b c))

<span style="color: #af00ff;">=&gt;</span> ((1 A B C)
    (2 A B C)
    (3 A B C))
</pre>
</div>
</div>
</div>
