org/lrn/lisp/lisp-3.org
* Окружения и MyApply

Это глобальное окружение, которое было сделано на предыдущем этапе и функция поиска в
нем (~lookup~), тут ничего не поменялось.

#+NAME: lookup_3
#+BEGIN_SRC lisp
  (defparameter *glob-env* nil)

  (defun lookup (symb env)
    (let ((it (assoc symb env)))
      (if (not (null it))
          it
          (assoc symb *glob-env*))))
#+END_SRC

Чтобы сделать лексическое окружение, нужно создать структуру замыкания:

#+NAME: closure_3
#+BEGIN_SRC lisp
  (defstruct closure
    body
    env
    args)
#+END_SRC

Когда нам нужно передать лямбду в функцию ~apply~ мы будем оборачивать ее в замыкание,
сохраняя окружение функции в нем:

#+NAME: myapply_closure_3
#+BEGIN_SRC lisp
  ((closure-p fn)              (myeval (closure-body fn)
                                       (pairlis (closure-args fn)
                                                args
                                                (closure-env fn))))
#+END_SRC

Этим куском кода мы заменяем обработку ~lambda~ внутри ~myapply~.


#+NAME: errors_3
#+BEGIN_SRC lisp
  (define-condition unknown-function (error)
    ((fn :initarg :fn  :reader fn))
    (:report
     (lambda (condition stream)
       (format stream "Error in MYAPPLY: unknown-function: ~A"
               (fn condition)))))
#+END_SRC

#+NAME: myapply_3
#+BEGIN_SRC lisp
  <<evaddmul_3>>
  (defun myapply (fn args env)
    (cond
      <<myapply_car_cdr_cons_3>>
      <<myapply_null_3>>
      <<myapply_ariph_3>>
      <<myapply_closure_3>>
      (t (error 'unknown-function :fn fn))))
#+END_SRC

И отдельно вынесем тесты:

#+NAME: myapply_3_test
#+BEGIN_SRC lisp
  <<myapply_car_cdr_cons_3_test>>
  <<myapply_null_3_test>>
  <<evaddmul_3_test>>
  <<myapply_ariph_3_test>>
  <<myapply_func_symb_3_test>>
  ;; TODO : нужен тест для closure в apply
  <<myapply_closure_3_test>>
#+END_SRC

** Работа с CONS-ячейками

#+NAME: myapply_car_cdr_cons_3
#+BEGIN_SRC lisp
  ((equal fn 'car)             (caar args))
  ((equal fn 'cdr)             (cdar args))
  ((equal fn 'cons)            (cons (car args) (cadr args)))
#+END_SRC

#+NAME: myapply_car_cdr_cons_3_test
#+BEGIN_SRC lisp
  ;; Тесты для cons-ячеек
  (assert (equal '(1 . 2) (myeval '(cons 1 2) nil)))
  (assert (equal '((1 . 2) 3 . 4) (myeval '(cons (cons 1 2) (cons 3 4)) nil)))
  (assert (equal 2 (myeval '(car (cons 2 3)) nil)))
  (assert (equal 3 (myeval '(cdr (cons 2 3)) nil)))
  (assert (equal '(1 . 2) (myeval '(car (cons (cons 1 2) (cons 3 4))) nil)))
  (assert (equal '(3 . 4) (myeval '(cdr (cons (cons 1 2) (cons 3 4))) nil)))
  ;; Тесты для cons-ячеек, вычисляемых в окружении
  (assert (equal 1 (myeval '(car a) '((a . (1 . 2))))))
  (assert (equal 2 (myeval '(cdr a) '((a . (1 . 2))))))
  (assert (equal 3 (myeval '(car b) '((a . (1 . 2)) (b . (3 . 4))))))
#+END_SRC

** NULL-предикат

#+NAME: errors_3
#+BEGIN_SRC lisp
  (define-condition invalid-number-of-arguments (error)
    ((fn :initarg :fn  :reader fn))
    (:report
     (lambda (condition stream)
       (format stream "Error in MYAPPLY: invalid-number-of-arguments: ~A"
               (fn condition)))))
#+END_SRC

#+NAME: myapply_null_3
#+BEGIN_SRC lisp
  ((equal fn 'null)            (if (null (cdr args))
                                   (null (car args))
                                   (error 'invalid-number-of-arguments :fn fn)))
#+END_SRC

#+NAME: myapply_null_3_test
#+BEGIN_SRC lisp
  ;; Тесты для NULL
  (assert (equal T (myeval '(null ()) nil)))
  (assert (equal T (myeval '(null nil) nil)))
  (assert (equal NIL (myeval '(null T) nil)))
  (assert (equal T (myeval '(null a) '((a . ())))))
  ;; Тесты для NULL, с аргументом, вычисляемые в окружении
  (assert (equal NIL (myeval '(null a) '((a . T)))))
  (assert (equal NIL (myeval '(null a) '((a . 1)))))
#+END_SRC

