www/lrn/lisp/lisp-3.html

<div id="outline-container-unnumbered-2" class="outline-2">
<h2 id="unnumbered-2">Окружения и MyApply</h2>
<div class="outline-text-2" id="text-unnumbered-2">
<p>
Это глобальное окружение, которое было сделано на предыдущем этапе и функция поиска в
нем (<code>lookup</code>), тут ничего не поменялось.
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="lookup_3">(<span style="color: #af00ff;">defparameter</span> <span style="color: #af5f00;">*glob-env*</span> nil)

(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">lookup</span> (symb env)
  (<span style="color: #af00ff;">let</span> ((it (assoc symb env)))
    (<span style="color: #af00ff;">if</span> (not (null it))
        it
        (assoc symb *glob-env*))))
</pre>
</div>

<p>
Чтобы сделать лексическое окружение, нужно создать структуру замыкания:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="closure_3">(<span style="color: #af00ff;">defstruct</span> <span style="color: #008700;">closure</span>
  body
  env
  args)
</pre>
</div>

<p>
Когда нам нужно передать лямбду в функцию <code>apply</code> мы будем оборачивать ее в замыкание,
сохраняя окружение функции в нем:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myapply_closure_3">((closure-p fn)              (myeval (closure-body fn)
                                     (pairlis (closure-args fn)
                                              args
                                              (closure-env fn))))
</pre>
</div>

<p>
Этим куском кода мы заменяем обработку <code>lambda</code> внутри <code>myapply</code>.
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myapply_3">&lt;&lt;evaddmul_3&gt;&gt;
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">myapply</span> (fn args env)
  (<span style="color: #af00ff;">cond</span>
    &lt;&lt;myapply_car_cdr_cons_3&gt;&gt;
    &lt;&lt;myapply_null_3&gt;&gt;
    &lt;&lt;myapply_ariph_3&gt;&gt;
    &lt;&lt;myapply_closure_3&gt;&gt;
    ))
</pre>
</div>

<p>
И отдельно вынесем тесты:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myapply_3_test">&lt;&lt;myapply_car_cdr_cons_3_test&gt;&gt;
&lt;&lt;myapply_null_3_test&gt;&gt;
&lt;&lt;evaddmul_3_test&gt;&gt;
&lt;&lt;myapply_ariph_3_test&gt;&gt;
&lt;&lt;myapply_func_symb_3_test&gt;&gt;
<span style="color: #af0000;">;; </span><span style="color: #af0000;">TODO : &#1085;&#1091;&#1078;&#1077;&#1085; &#1090;&#1077;&#1089;&#1090; &#1076;&#1083;&#1103; closure &#1074; apply</span>
&lt;&lt;myapply_closure_3_test&gt;&gt;
</pre>
</div>
</div>

<div id="outline-container-unnumbered-3" class="outline-3">
<h3 id="unnumbered-3">Работа с CONS-ячейками</h3>
<div class="outline-text-3" id="text-unnumbered-3">
<div class="org-src-container">

<pre class="src src-lisp" id="myapply_car_cdr_cons_3">((equal fn 'car)             (caar args))
((equal fn 'cdr)             (cdar args))
((equal fn 'cons)            (cons (car args) (cadr args)))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-lisp" id="myapply_car_cdr_cons_3_test"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; cons-&#1103;&#1095;&#1077;&#1077;&#1082;</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(1 . 2) (myeval '(cons 1 2) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '((1 . 2) 3 . 4) (myeval '(cons (cons 1 2) (cons 3 4)) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2 (myeval '(car (cons 2 3)) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 3 (myeval '(cdr (cons 2 3)) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(1 . 2) (myeval '(car (cons (cons 1 2) (cons 3 4))) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(3 . 4) (myeval '(cdr (cons (cons 1 2) (cons 3 4))) nil)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; cons-&#1103;&#1095;&#1077;&#1077;&#1082;, &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1103;&#1077;&#1084;&#1099;&#1093; &#1074; &#1086;&#1082;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1080;</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 1 (myeval '(car a) '((a . (1 . 2))))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2 (myeval '(cdr a) '((a . (1 . 2))))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 3 (myeval '(car b) '((a . (1 . 2)) (b . (3 . 4))))))
</pre>
</div>
</div>
</div>
