org/lrn/lisp/lisp-3.org
** CANCEL Вычисление символов-функций

#+NAME: errors_3
#+BEGIN_SRC lisp
  (define-condition function-not-found-error (error)
    ((fn :initarg :fn  :reader fn))
    (:report
     (lambda (condition stream)
       (format stream "Error in MYAPPLY: function not found: ~A"
               (fn condition)))))
#+END_SRC

Этот кейс удаляем, потому что у нас это вычисление теперь производится в myeval

#+NAME: myapply_func_symb_3_DELETED
#+BEGIN_SRC lisp
  ((symbolp fn)                (let ((it (lookup fn env)))
                                 (if (null it)
                                     (error 'function-not-found-error :fn fn)
                                     (myapply (cdr it) args env))))
#+END_SRC

И тест видоизменяется, чтобы проверить вычисление в глобальном окружении
[TODO:gmm] Тут я не уверен что правильный тест

#+NAME: myapply_func_symb_3_test
#+BEGIN_SRC lisp
  (assert (equal 49 (progn
                      (setf *glob-env* nil)
                      (myeval '(defun alfa (x) (* x x)) nil)
                      (myeval '(setq beta 7) nil)
                      (prog1 (myeval '(alfa beta) nil)
                        (setf *glob-env* nil)))))
  ;; (assert (equal "error"
  ;;                (handler-case (myeval '(alfa beta) '((beta . 7)))
  ;;                  (FUNCTION-NOT-FOUND-ERROR (condition) "error"))))
#+END_SRC

** CANCEL LAMBDA

Этот код больше не используется, и будет удален в следующем файле. Вместо него мы
создаем замыкания

#+NAME: myapply_lambda_3
#+BEGIN_SRC lisp
  ((equal (car fn) 'lambda)    (myeval (car (cddr fn))
                                       (pairlis (car (cdr fn))
                                                args
                                                env)))
#+END_SRC

#+NAME: myapply_lambda_3_test
#+BEGIN_SRC lisp
  (assert (equal '(42 . 42) (myeval '((lambda (x)
                                        (cons x x))
                                      42) nil)))
  (assert (equal '(42 . 17) (myeval '((lambda (x y)
                                        (cons x y))
                                      42 17) nil)))
#+END_SRC

* MyEval

#+NAME: myeval_3
#+BEGIN_SRC lisp
  <<myeval_evcond_3>>
  <<myeval_evprogn_3>>
  <<myeval_evlis_3>>
  <<myeval_evand_3>>
  <<myeval_evor_3>>
  <<myeval_mypairlis_3>>
  <<myeval_evletstar_3>>

  (defun myeval (lst env)
    (cond
      <<myeval_number_3>>
      <<myeval_symb_3>>
      <<myeval_quote_3>>
      <<myeval_if_3>>
      <<myeval_cond_3>>
      <<myeval_progn_3>>
      <<myeval_print_3>>
      <<myeval_list_3>>
      <<myeval_and_3>>
      <<myeval_or_3>>
      <<myeval_let_3>>
      <<myeval_letstar_3>>
      <<myeval_defun_3>>
      <<myeval_setq_3>>
      <<myeval_lambda_3>>
      (t
       (myapply (myeval (car lst) env)
                (evlis (cdr lst) nil env)
                env))))
#+END_SRC

#+NAME: myeval_3_test
#+BEGIN_SRC lisp
  <<myeval_number_3_test>>
  <<myeval_symb_3_test>>
  <<myeval_quote_3_test>>
  <<myeval_if_3_test>>
  <<myeval_evcond_3_test>>
  <<myeval_cond_3_test>>
  <<myeval_evprogn_3_test>>
  <<myeval_progn_3_test>>
  <<myeval_print_3_test>>
  <<myeval_evlis_3_test>>
  <<myeval_list_3_test>>
  <<myeval_evand_3_test>>
  <<myeval_and_3_test>>
  <<myeval_evor_3_test>>
  <<myeval_or_3_test>>
  <<myeval_mypairlis_3_test>>
  <<myeval_let_3_test>>
  <<myeval_letstar_3_test>>
  <<myeval_defun_3_test>>
  <<myeval_setq_3_test>>
  <<myeval_lambda_3_test>>
#+END_SRC

** Самовычисляемые формы

#+NAME: myeval_number_3
#+BEGIN_SRC lisp
  ((null lst)                  nil)
  ((equal t lst)               t)
  ((member lst '(+ * car cdr cons null))  lst)
  ((numberp lst)               lst)
#+END_SRC

#+NAME: myeval_number_3_test
#+BEGIN_SRC lisp
  (assert (equal T (myeval 'T nil)))
  (assert (equal NIL (myeval 'NIL nil)))
  (assert (equal 999 (myeval 999 nil)))
#+END_SRC

** Вычисление символов

#+NAME: errors_3
#+BEGIN_SRC lisp
  (define-condition var-not-found-error (error)
    ((vari :initarg :vari  :reader vari))
    (:report
     (lambda (condition stream)
       (format stream "Error in MYEVAL: variable not found: ~A"
               (vari condition)))))
#+END_SRC

#+NAME: myeval_symb_3
#+BEGIN_SRC lisp
  ((symbolp lst)               (let ((it (lookup lst env)))
                                 (if (null it)
                                     (error 'var-not-found-error :vari lst)
                                     (cdr it))))
#+END_SRC

#+NAME: myeval_symb_3_test
#+BEGIN_SRC lisp
  ;; Тесты для вычисления символов в окружении
  (assert (equal 6 (myeval 'b '((a . 3) (b . 6)))))
  (assert (equal "error"
                 (handler-case (myeval 'b nil)
                   (VAR-NOT-FOUND-ERROR (condition) "error"))))
#+END_SRC

** Цитирование

#+NAME: myeval_quote_3
#+BEGIN_SRC lisp
  ((equal (car lst) 'quote)    (cadr lst))
#+END_SRC

#+NAME: myeval_quote_3_test
#+BEGIN_SRC lisp
  ;; Тесты для QUOTE
  (assert (equal '(+ 1 2) (myeval '(quote (+ 1 2)) nil)))
#+END_SRC

