www/lrn/lisp/lisp-3.html

<div id="outline-container-unnumbered-6" class="outline-3">
<h3 id="unnumbered-6"><span class="done CANCEL">CANCEL</span> Вычисление символов-функций</h3>
<div class="outline-text-3" id="text-unnumbered-6">
<div class="org-src-container">

<pre class="src src-lisp" id="errors_3">(<span style="color: #af00ff;">define-condition</span> <span style="color: #0000ff;">function-not-found-error</span> (<span style="color: #ff0000; font-weight: bold;">error</span>)
  ((fn <span style="color: #5f5f87;">:initarg</span> <span style="color: #5f5f87;">:fn</span>  <span style="color: #5f5f87;">:reader</span> fn))
  (<span style="color: #5f5f87;">:report</span>
   (<span style="color: #af00ff;">lambda</span> (condition stream)
     (format stream <span style="color: #87005f;">"Error in MYAPPLY: function not found: ~A"</span>
             (fn condition)))))
</pre>
</div>

<p>
Этот кейс удаляем, потому что у нас это вычисление теперь производится в myeval
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myapply_func_symb_3_DELETED">((symbolp fn)                (<span style="color: #af00ff;">let</span> ((it (lookup fn env)))
                               (<span style="color: #af00ff;">if</span> (null it)
                                   (<span style="color: #ff0000; font-weight: bold;">error</span> 'function-not-found-error <span style="color: #5f5f87;">:fn</span> fn)
                                   (myapply (cdr it) args env))))
</pre>
</div>

<p>
И тест видоизменяется, чтобы проверить вычисление в глобальном окружении
[TODO:gmm] Тут я не уверен что правильный тест
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myapply_func_symb_3_test">(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 49 (<span style="color: #af00ff;">progn</span>
                    (setf *glob-env* nil)
                    (myeval '(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">alfa</span> (x) (* x x)) nil)
                    (myeval '(setq beta 7) nil)
                    (<span style="color: #af00ff;">prog1</span> (myeval '(alfa beta) nil)
                      (setf *glob-env* nil)))))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">(assert (equal "error"</span>
<span style="color: #af0000;">;;                </span><span style="color: #af0000;">(handler-case (myeval '(alfa beta) '((beta . 7)))</span>
<span style="color: #af0000;">;;                  </span><span style="color: #af0000;">(FUNCTION-NOT-FOUND-ERROR (condition) "error"))))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-7" class="outline-3">
<h3 id="unnumbered-7"><span class="done CANCEL">CANCEL</span> LAMBDA</h3>
<div class="outline-text-3" id="text-unnumbered-7">
<p>
Этот код больше не используется, и будет удален в следующем файле. Вместо него мы
создаем замыкания
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myapply_lambda_3">((equal (car fn) 'lambda)    (myeval (car (cddr fn))
                                     (pairlis (car (cdr fn))
                                              args
                                              env)))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-lisp" id="myapply_lambda_3_test">(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(42 . 42) (myeval '((<span style="color: #af00ff;">lambda</span> (x)
                                      (cons x x))
                                    42) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(42 . 17) (myeval '((<span style="color: #af00ff;">lambda</span> (x y)
                                      (cons x y))
                                    42 17) nil)))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-unnumbered-8" class="outline-2">
<h2 id="unnumbered-8">MyEval</h2>
<div class="outline-text-2" id="text-unnumbered-8">
<div class="org-src-container">

<pre class="src src-lisp" id="myeval_3">&lt;&lt;myeval_evcond_3&gt;&gt;
&lt;&lt;myeval_evprogn_3&gt;&gt;
&lt;&lt;myeval_evlis_3&gt;&gt;
&lt;&lt;myeval_evand_3&gt;&gt;
&lt;&lt;myeval_evor_3&gt;&gt;
&lt;&lt;myeval_mypairlis_3&gt;&gt;
&lt;&lt;myeval_evletstar_3&gt;&gt;

(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">myeval</span> (lst env)
  (<span style="color: #af00ff;">cond</span>
    &lt;&lt;myeval_number_3&gt;&gt;
    &lt;&lt;myeval_symb_3&gt;&gt;
    &lt;&lt;myeval_quote_3&gt;&gt;
    &lt;&lt;myeval_if_3&gt;&gt;
    &lt;&lt;myeval_cond_3&gt;&gt;
    &lt;&lt;myeval_progn_3&gt;&gt;
    &lt;&lt;myeval_print_3&gt;&gt;
    &lt;&lt;myeval_list_3&gt;&gt;
    &lt;&lt;myeval_and_3&gt;&gt;
    &lt;&lt;myeval_or_3&gt;&gt;
    &lt;&lt;myeval_let_3&gt;&gt;
    &lt;&lt;myeval_letstar_3&gt;&gt;
    &lt;&lt;myeval_defun_3&gt;&gt;
    &lt;&lt;myeval_setq_3&gt;&gt;
    &lt;&lt;myeval_lambda_3&gt;&gt;
    (t
     (myapply (myeval (car lst) env)
              (evlis (cdr lst) nil env)
              env))))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_3_test">&lt;&lt;myeval_number_3_test&gt;&gt;
&lt;&lt;myeval_symb_3_test&gt;&gt;
&lt;&lt;myeval_quote_3_test&gt;&gt;
&lt;&lt;myeval_if_3_test&gt;&gt;
&lt;&lt;myeval_evcond_3_test&gt;&gt;
&lt;&lt;myeval_cond_3_test&gt;&gt;
&lt;&lt;myeval_evprogn_3_test&gt;&gt;
&lt;&lt;myeval_progn_3_test&gt;&gt;
&lt;&lt;myeval_print_3_test&gt;&gt;
&lt;&lt;myeval_evlis_3_test&gt;&gt;
&lt;&lt;myeval_list_3_test&gt;&gt;
&lt;&lt;myeval_evand_3_test&gt;&gt;
&lt;&lt;myeval_and_3_test&gt;&gt;
&lt;&lt;myeval_evor_3_test&gt;&gt;
&lt;&lt;myeval_or_3_test&gt;&gt;
&lt;&lt;myeval_mypairlis_3_test&gt;&gt;
&lt;&lt;myeval_let_3_test&gt;&gt;
&lt;&lt;myeval_letstar_3_test&gt;&gt;
&lt;&lt;myeval_defun_3_test&gt;&gt;
&lt;&lt;myeval_setq_3_test&gt;&gt;
&lt;&lt;myeval_lambda_3_test&gt;&gt;
</pre>
</div>
</div>

<div id="outline-container-unnumbered-9" class="outline-3">
<h3 id="unnumbered-9">Самовычисляемые формы</h3>
<div class="outline-text-3" id="text-unnumbered-9">
<div class="org-src-container">

<pre class="src src-lisp" id="myeval_number_3">((null lst)                  nil)
((equal t lst)               t)
((member lst '(+ * car cdr cons null))  lst)
((numberp lst)               lst)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_number_3_test">(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal T (myeval 'T nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal NIL (myeval 'NIL nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 999 (myeval 999 nil)))
</pre>
</div>
</div>
</div>
